sources/MeasurementUnits/Catalogs/МСЕдиницыВеличинБазовые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МСЕдиницыВеличинБазовые</Name>
			<Comment>Основные и производные единицы величин, имеющие специальное наименование</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоОсновнаяЕдиница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКогерентнаяЕдиница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетСпециальныеНаименованиеИОбозначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МСЕдиницыВеличинВиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>63</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбозначениеРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробелПередОбозначениемРус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредлогДляЗнаменателяРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМн</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>63</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбозначениеМн</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробелПередОбозначениемМн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредлогДляЗнаменателяМн</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание степени для кратных и дольных приставок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредлогЗнаменателяНаименованияСоставнойЕдиницыВеличины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНаименованиеСтепениКакПрилагательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент к базовой (не обязательно когерентной) единице</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приставка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МСЕдиницыВеличинПриставкиКратныхИДольных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МСЕдиницыВеличинБазовые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательСтепени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/MeasurementUnits/CommonModules/МСЕдиницыВеличинСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Метрологическая служба. Единицы величин".
// ОбщийМодуль.МСЕдиницыВеличинСервер.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Работа с обозначениями

// Формирует обозначение единицы величины по её выражению из базовых.
//
// Параметры:
// 	Единица	- Ссылка, Объект, Структура	- Ссылка на объект единицы величины.
// 	ОбозначенияЕдиницыВеличин - МСЕдиницыВеличинОбозначения	- Вариант обозначения
//	  единиц величин.
//
// Возвращаемое значение:
//  Строка - Обозначение единицы величины.
//
Функция СформироватьОбозначениеЕдиницыВеличины(Знач Единица, Знач ОбозначенияЕдиницыВеличин = Неопределено) Экспорт
	
	Перем Обозначение;
	Перем ПредставлениеМножителя;
	
	//ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
	//	"МСЕдиницыВеличинСервер.СформироватьОбозначениеЕдиницыВеличины",
	//	"Единица",
	//	Единица,
	//	Новый ОписаниеТипов("СправочникСсылка.УдалитьМСЕдиницыВеличин, СправочникОбъект.МСЕдиницыВеличин, ДанныеФормыСтруктура"));
		
	Если ОбозначенияЕдиницыВеличин = Неопределено Тогда
		ОбозначенияЕдиницыВеличин = ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения");
	КонецЕсли;

	Обозначение = "";
	
	Если Единица <> Справочники.МСЕдиницыВеличинБазовые.ПустаяСсылка() Тогда 
		Для Каждого Множитель Из Единица.Выражение Цикл
			Если Число(Множитель.ПоказательСтепени) <> 0 Тогда 
				ПредставлениеМножителя =
					МСЕдиницыВеличинКлиентСервер.ПолучитьОбозначение(Множитель.Приставка)
					+ МСЕдиницыВеличинКлиентСервер.ПолучитьОбозначение(Множитель.БазоваяЕдиница)
					+ РаботаСоСтрокамиЮникодКлиентСервер.ПолучитьСтрокуИзПоказателяСтепениКраткую(Множитель.ПоказательСтепени)
				;
				Обозначение = ?(НЕ ПустаяСтрока(Обозначение),Обозначение + "⋅","") + ПредставлениеМножителя;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Обозначение;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с наименованиями

// Формирует наименование единицы величины по её выражению из базовых.
//
// Параметры:
// 	Единица		- Ссылка, Объект, Структура	- Сссылка на объект единицы величины.
// 	ОбозначенияЕдиницыВеличин - МСЕдиницыВеличинОбозначения	- Вариант обозначения
//	  единиц величин.
//
// Возвращаемое значение:
//  Строка - Наименование единицы величины.
//
Функция СформироватьНаименованиеЕдиницыВеличины(Знач Единица, Знач ОбозначенияЕдиницыВеличин = Неопределено) Экспорт
	//ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
	//	"МСЕдиницыВеличинСервер.СформироватьНаименованиеЕдиницыВеличины",
	//	"Единица",
	//	Единица,
	//	Новый ОписаниеТипов("СправочникСсылка.УдалитьМСЕдиницыВеличин, СправочникОбъект.МСЕдиницыВеличин, ДанныеФормыСтруктура"));
	Если Единица <> Справочники.МСЕдиницыВеличинБазовые.ПустаяСсылка() Тогда 
		НаименованиеЧислителя = "";
		НаименованиеЗнаменателя = "";
		Предлог = "";
		Для Каждого Множитель Из Единица.Выражение Цикл
			МодульПоказателяСтепени = ?(Множитель.ПоказательСтепени < 0,
				-Множитель.ПоказательСтепени,
				Множитель.ПоказательСтепени
			);
			Падеж = ?(Множитель.ПоказательСтепени > 0, 1, 4);
			
			ПредставлениеМножителя =
				МСЕдиницыВеличинКлиентСервер.ПолучитьНаименование(Множитель.Приставка)
				+ СклонениеПредставленийОбъектов.ПросклонятьПредставление(
					МСЕдиницыВеличинКлиентСервер.ПолучитьНаименование(Множитель.БазоваяЕдиница)
					, Падеж, Множитель.БазоваяЕдиница)
			;
			Если Множитель.БазоваяЕдиница.ИспользоватьНаименованиеСтепениКакПрилагательное
				И МодульПоказателяСтепени >= 2
				И МодульПоказателяСтепени <= 3
			Тогда 
				ПредставлениеМножителя =
					РаботаСоСтрокамиЮникодСерверПовтИсп.ПолучитьНаименованиеИзПоказателяСтепениКакПрилагательное(МодульПоказателяСтепени, Падеж)
					+ " " + ПредставлениеМножителя
				;
			ИначеЕсли МодульПоказателяСтепени >= 2 Тогда
				ПредставлениеМножителя = ПредставлениеМножителя + " "
					+ РаботаСоСтрокамиЮникодСерверПовтИсп.ПолучитьНаименованиеИзПоказателяСтепени(МодульПоказателяСтепени)
				;
			КонецЕсли;
			
			Если Множитель.ПоказательСтепени > 0 Тогда
				НаименованиеЧислителя = ?(НЕ ПустаяСтрока(НаименованиеЧислителя), НаименованиеЧислителя + "-", "") + ПредставлениеМножителя;
			ИначеЕсли Множитель.ПоказательСтепени < 0 Тогда
				НаименованиеЗнаменателя = ?(НЕ ПустаяСтрока(НаименованиеЗнаменателя), НаименованиеЗнаменателя + "-", "") + ПредставлениеМножителя;
				Если ПустаяСтрока(Предлог) И (МодульПоказателяСтепени = 1) Тогда
					Предлог = Множитель.БазоваяЕдиница.УдалитьПредлогЗнаменателяНаименованияСоставнойЕдиницыВеличины;
				Иначе
					Предлог = "на";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат 
			?(ПустаяСтрока(НаименованиеЧислителя), "единица", НаименованиеЧислителя)
			+ ?(ПустаяСтрока(НаименованиеЗнаменателя), "", " " + Предлог + " " + НаименованиеЗнаменателя)
		;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти
